{
    "number": 1515,
    "news": [
        "Специально к весенним школьным каникулам, которые проходят с 24 по 30 марта 2025 года, музей-заповедник «Петергоф» подготовил особое расписание работы.\nПарки\nНижний парк, Верхний сад, парки Александрия и Ораниенбаум открыты для посетителей ежедневно и бесплатно\nНижний парк: с 9:00 до 18:00\nВерхний сад: с 9:00 до 18:00\nПарк Александрия: с 9:00 до 20:00\nПарк Ораниенбаум: с 9:00 до 20:00\nМузеи\nСпециально в каникулы ежедневно будут открыты Павильон Катальной горки в Ораниенбауме и Дворцовая телеграфная станция в Александрии.\nПавильон Катальной горки\nРаботает ежедневно с 24 по 30 марта\nОткрыт с 10:30 до 17:00\nКассы и вход до 16:00\nКупить билет\nДворцовая телеграфная станция\nРаботает ежедневно с 24 по 30 марта\nОткрыт с 10:30 до 17:00\nКассы и вход до 16:00\nКупить билет\nОстальные музеи будут работать по\nобычному расписанию\n, а Большой петергофский дворец — дополнительно во вторник.\nПроект «Гидрокосмос»\nВ Большой оранжерее развернулся проект\n«Гидрокосмос»\n. В центре внимания — находки с трех кораблей, затонувших в Балтийском море в XVIII–XIX веках. А героями проекта стали водолазы, которые и создают гидрокосмос, постоянно расширяют пределы человеческого знания и меняют наши представления об истории. Будет интересно не только детям, но и взрослым.\nПространство «Большая оранжерея», Нижний парк\nРаботает ежедневно с 24 по 30 марта\nОткрыт с 9:30 до 18:00\nКасса и вход до 17:30\nДетские дни 2025: «Море говорит и показывает»\nВместе с педагогами Новой Фермы на детской программе «Море говорит и показывает» (6+) дети и родители не только познакомятся с артефактами, поднятыми с морского дна, но и познают тонкости работы подводного археолога. Каждому участнику предстоит: пройти инструктаж, примерить снаряжение водолаза, освоить способы подводного общения, изучить предметы на ощупь и сделать археологические зарисовки.\nПрограмма проходит на экспозиции проекта «Гидрокосмос» в пространстве «Большая оранжерея».\nРасписание и билеты",
        "В пространстве «Большая оранжерея» в Нижнем парке открылся «Гидрокосмос» — совместный проект музея-заповедника «Петергоф» и Центра подводных исследований Русского географического общества при поддержке Президентского фонда культурных инициатив. Проект объединяет экспозицию артефактов с затонувших кораблей XVIII–XIX веков, образовательную программу для школ и семейной аудитории, а также научно-практическую конференцию.\nГероями проекта стали водолазы, которые и создают гидрокосмос, постоянно расширяют пределы человеческого знания и меняют наши представления об истории. Находки подводных археологов — посуда, одежда и иногда даже еда — сегодня становятся частью музейных коллекций и рассказывают нам о быте разных людей, культур и целых эпох.\n«В детстве каждый, читая про смельчаков, героев и энтузиастов, находящих невероятные артефакты в подводных мирах, хотел так же смотреть в глубины неизведанного. Меня это всегда вдохновляло и вдохновляет сейчас. Поэтому нам особенно трепетно делать совместный проект с Центром подводных исследований РГО. Мы хотим показать людям, насколько эта работа интересна и сложна, насколько она полезна для музейного мира. Как и многое, становление подводной археологии в России напрямую связано Петром I, ведь именно он издал указ выявлять и сохранять находки как на земле, так и под водой. Поэтому этот проект открывается в одном из самых петровских мест — в Петергофе», — отметил генеральный директор музея-заповедника «Петергоф» Роман Ковриков.\n«Подводная археология — сложный и даже опасный вид исследований. Мы почти никогда не работаем в комфортных условиях: обычно это где-то далеко от берега, в холодной воде и с видимостью не больше метра. К тому же водолаз может запутаться в скопившемся мусоре, как рыба в сетях, — поэтому корабль сначала нужно очистить от тросов, веревок и канатов. Самые многообещающие суда — это, конечно, хорошо сохранившиеся, с целыми помещениями. На таких объектах чаще всего и содержимое интереснее», — поделился Сергей Фокин, исполнительный директор Центра подводных исследований Русского географического общества, водолаз-исследователь.\nВ основе экспозиции, представляющей собой условную модель корабля — находки с затонувших в Балтийском море недалеко от Петергофа в XVIII–XIX веках кораблей. Это медная кухонная утварь, аптекарские принадлежности, дорогой китайский фаянс, шелковые платки, навигационные инструменты и даже ящики с бутылками вина, которые сохранились благодаря слабой солености воды.\n«Сейчас музейная археология и то, что мы получаем со дна разных морей, это очень важный музейный ресурс в плане предметов XVIII-XIX столетий. Мы решили сделать развернутый комплексный проект, который включает в себя экспозицию, где мы показываем находки с трех кораблей, научно-практическую конференцию и детскую программу. Нашей аудитории — семейной, детской, школьной — мы будем рассказывать, что такое профессия подводного археолога и что она дает музею, что она дает новым экспозициям», — рассказала заместитель генерального директора по культурно-просветительской работе музея-заповедника «Петергоф» Анна Ляшко.\nСпециальная детская программа «Море говорит и показывает», которую музей-заповедник «Петергоф» разработал в рамках проекта, познакомит детей и родителей с тем, как устроен мир подводных исследований: участники не только познакомятся с артефактами, поднятыми с морского дна, но и примерят снаряжение водолаза, освоят способы подводного общения и изучат предметы на ощупь. А научно-практическая конференция объединит специалистов из разных областей и поднимет технологические, организационные и правовые аспекты работы с подводными артефактами, а также проблемные точки, касающиеся их статуса, легального перемещения и документального сопровождения на суше.\nЭкспозиция в Большой оранжерее будет доступна для посетителей до 26 июля 2025 года —\nподробнее\n.",
        "Обладатели электронного сертификата программы «Серебряный возраст» в музее-заповеднике «Петергоф» могут посетить Большой петергофский дворец, Большой Меншиковский дворец и дворец «Коттедж». Покупка билета по электронному сертификату возможна только в кассах музеев.\nЭлектронный сертификат номиналом в 1500 рублей на покупку билетов в федеральные и региональные музеи — новая мера поддержки для граждан «серебряного возраста». Его могут оформить женщины старше 55 лет и мужчины старше 60 лет при наличии Единой карты петербуржца (ЕКП) или ЕКП «Серебряный возраст» и постоянной регистрации в Санкт-Петербурге. Подробнее о программе — на\nпортале Единой карты петербуржца\n.\nОбращаем внимание:\nпри посещении музеев в летний период необходимо будет дополнительно приобрести билеты в парки.",
        "Сотрудничество позволит посетителям музея использовать современные технологии и сервисы, в том числе на основе искусственного интеллекта\nСбер и «Петергоф» будут вместе внедрять современные технологии в музейные практики, что позволит посетителям получить новый эмоциональный опыт от знакомства с важнейшим культурно-историческим наследием России. Соглашение о сотрудничестве двух организаций подписали Президент, Председатель Правления Сбербанка Герман Греф и генеральный директор музея-заповедника «Петергоф» Роман Ковриков.\n«Сохранение и изучение национального наследия, его реставрация и показ широкому кругу зрителей, организация работы с посетителями, привлечение молодого поколения — ключевые направления деятельности современного музея. Технологии искусственного интеллекта способны вывести эту работу на совершенно иной уровень. Тесное взаимодействие музеев и представителей крупного бизнеса сегодня позволяет не просто объединить накопленные знания, но и внедрить новые подходы», — Министр культуры РФ Ольга Любимова.\n«Музею сегодня важно не отставать от стремительно меняющегося мира и отвечать на запросы посетителей. Для этого необходимо вдумчиво внедрять цифровые технологии, позволяющие анализировать посетительский опыт, коллекцию и рабочие процессы внутри музея. Так мы сможем и лучше узнать своего посетителя, и предложить ему именно то, за чем он будет возвращаться к нам. Для реализации этих целей нам нужна поддержка и участие надёжных партнёров, которые разделяют наши ценности», — генеральный директор музея-заповедника «Петергоф» Роман Ковриков.\n«У нас за плечами уже немало совместных проектов с музеем-заповедником \"Петергоф\" — это и реставрация легендарной скульптурной группы \"Самсон, разрывающий пасть льва\", и ряд тематических экспозиций. Подписание соглашения о сотрудничестве выводит наше взаимодействие на новый уровень. Мы будем фокусироваться на развитии технологий искусственного интеллекта в музейном деле, чтобы дать посетителям уникальный интерактивный опыт, который позволит ещё глубже погрузиться в историю нашей страны», — Президент, Председатель Правления Сбербанка Герман Греф.\nСбер и «Петергоф» планируют вместе развивать научно-исследовательскую, культурно-просветительскую и инновационную деятельность для сохранения исторического наследия, создавать и совершенствовать цифровые технологии и сервисы для посетителей. Также в фокусе внимания — разработка современных подходов к развитию и изменению операционной деятельности культурных организаций, в том числе с использованием искусственного интеллекта.",
        "8 марта 2025 года в Международный женский день Большой петергофский дворец в Петергофе и Большой Меншиковский дворец в Ораниенбауме будут открыты бесплатно для женщин.\nБесплатный входной билет необходимо получить в кассе музея в день посещения.\nБольшой петергофский дворец занимает центральное место в композиции петергофского ансамбля. Началом его строительства принято считать указ Петра I от 4 февраля 1715 года. Существующий облик дворца формировался в течение почти полутора веков. Над его созданием и оформлением дворцовых интерьеров работали выдающиеся русские и западноевропейские мастера: Иоганн Браунштейн, Жан-Батист Леблон, Михаил Земцов, Франческо Растрелли, Юрий Фельтен, Андрей Штакеншнейдер. На протяжении всей своей истории дворец выполнял роль летней парадной резиденции царствующих монархов. Здесь проходили официальные государственные встречи и устраивались торжественные приемы и празднества. В годы Великой Отечественной войны Большой петергофский дворец был сожжен и взорван. Уже в мае 1964 года были открыты первые возрожденные залы. Сегодня дворец, которому возвращена былая красота, хранит уникальную память о людях и событиях.\nРежим работы Большого петергофского дворца 8 марта 2025 года\nОткрыт c 10:30 до 18:00, вход и кассы — до 17:00.\nВход во дворец и кассы — со стороны Нижнего парка.\nВход в Нижний парк в зимний период бесплатный.\nБольшой Меншиковский дворец — старейшее сооружение Ораниенбаума, в создании которого деятельное участие принимал Александр Меншиков. Для строительства своей резиденции Светлейший князь пригласил в 1711 году иностранных архитекторов: Франческо Фонтана, Иоганна Фридриха Браунштейна, Иоганна Готфрида Шеделя. В трехвековой истории Большого Меншиковского дворца времена расцвета неоднократно сменялись периодами забвения и упадка. Тем не менее, дворец избежал катастрофических разрушений, кардинальных перестроек и сохранился до наших дней, как один из немногих подлинных памятников русской архитектуры первой половины XVIII века.\nРежим работы Большого Меншиковского дворца 8 марта 2025 года\nОткрыт с 10:30 до 18:00, вход и кассы — с 12:00 до 13:30 и с 15:30 до 16:30.\nДворец расположен в парке Ораниенбаум, ближайший вход к музею со стороны Дворцового проспекта, 50.\nВход в парк Ораниенбаум в зимний период бесплатный.",
        "23 февраля 2025 года в День защитника Отечества Фермерский дворец будет открыт бесплатно для всех посетителей в честь Года защитника Отечества.\nБесплатный входной билет (не включает в себя экскурсионное обслуживание и посещение проекта «Петергофские дачники») необходимо получить в кассе музея или заранее на официальном сайте. Количество билетов ограничено.\nФермерский дворец — единственный дворец в России, построенный специально для Александра II. В разное время на его месте были молочная ферма, служебные и хозяйственные помещения, детские и учебные комнаты.\nВнутри дворца сохранились элементы первоначальной отделки — лепнина, камины, лестница, фрагменты росписей и дубового паркета. Здание было оснащено всеми необходимыми для проживания удобствами: лифт, водопровод, туалетные и ванные комнаты.\nСамый значимый интерьер Фермерского дворца — Синий кабинет Александра II. Здесь император принимал министров, заслушивал доклады о ходе военных действий, проводил заседания по реформированию страны. Именно здесь подготавливался важнейший законопроект об освобождении крестьян от крепостной зависимости. В Синем кабинете хранятся мемориальные вещи, принадлежавшие императору: кожаный портфель для документов, готовальня, распятие из слоновой кости, личные письма и фотографии. Сохранились кресла из первоначального мебельного убранства и уникальные часы с множеством циферблатов. Они показывали время в 67 губернских городах России и на Аляске. Кожаная подушка со следами крови, которая находилась в карете императора 1 марта 1881 года, напоминает о его трагической гибели.\nРежим работы Фермерского дворца 23 февраля 2025 года\nМузей открыт с 10:30 до 17:00, вход — до 16:00, кассы — до 16:00.\nПосещение Фермерского дворца возможно без экскурсии. Экскурсионное обслуживание может быть предоставлено за дополнительную плату.\nМузей расположен в парке Александрия, ближайший к музею вход в парк со стороны Санкт-Петербургского проспекта. Вход в парк Александрия в зимний период бесплатный.",
        "В конце декабря 2024 года музей-заповедник «Петергоф» открыл библиотечно-досуговый центр «Музей рядом» в Терпеньевском Доме культуры в селе Терпенье городского округа Мелитополь Запорожской области. В мероприятии приняли участие генеральный директор музея-заповедника Роман Ковриков и Министр культуры Запорожской области Роман Олексин.\n«Мы с огромной любовью и радостью делаем подобные центры. Каждый центр – это большая работа по созданию уникального пространства, где в уютной атмосфере вы можете увидеть себя в будущем и, возможно, посвятить себя музейному делу. Мы будем очень рады, если так и произойдет», — отметил Роман Ковриков.\nМузей-заповедник «Петергоф» провел в помещениях Дома культуры масштабный ремонт, реализовав оригинальный архитектурный проект. При поддержке Благотворительного фонда «Ладога» оснастил пространство современной мебелью, освещением и компьютерной техникой. При поддержке Санкт-Петербургского Дома книги был пополнен книжный фонд. «Петергоф» также организовал и провел обучение сотрудников Терпеньевского Дома культуры в образовательном центре «Новая ферма» и библиотеках Санкт-Петербурга.\n«В Новый год сбываются мечты. Наши коллеги — Государственный музей-заповедник “Петергоф” и Министерство культуры Российской Федерации — вновь сотворили чудо для наших жителей. Это уже второй центр в Запорожской области, который открывается под эгидой музея-заповедника. Мы искренне вас благодарим за это», — сказал Роман Олексин.\nВо время церемонии открытия также состоялось подписание соглашения о сотрудничестве между музеем-заповедником «Петергоф» и Домом культуры в селе Терпенье.\nПроект «Музей рядом» реализуется «Петергофом» под эгидой Министерства культуры Российской Федерации в рамках оказания поддержки музеям, расположенным на территории Луганской Народной Республики, Донецкой Народной Республики, Херсонской и Запорожской областей. В рамках этой поддержки за 2 года «Петергоф» были открыты и на данный момент успешно функционируют детские центры в Музее истории города Луганска (Луганск), Меловском краеведческом музей (поселок Меловое), Дворце культуры им. Т.Г. Шевченко (Мелитополь), библиотечно-досуговый центр в селе Новоданиловка Акимовского района (Запорожская область)."
    ]
}