{
    "number": 1507,
    "news": [
        "В конце декабря 2024 года музей-заповедник «Петергоф» открыл библиотечно-досуговый центр «Музей рядом» в Терпеньевском Доме культуры в селе Терпенье городского округа Мелитополь Запорожской области. В мероприятии приняли участие генеральный директор музея-заповедника Роман Ковриков и Министр культуры Запорожской области Роман Олексин.\n«Мы с огромной любовью и радостью делаем подобные центры. Каждый центр – это большая работа по созданию уникального пространства, где в уютной атмосфере вы можете увидеть себя в будущем и, возможно, посвятить себя музейному делу. Мы будем очень рады, если так и произойдет», — отметил Роман Ковриков.\nМузей-заповедник «Петергоф» провел в помещениях Дома культуры масштабный ремонт, реализовав оригинальный архитектурный проект. При поддержке Благотворительного фонда «Ладога» оснастил пространство современной мебелью, освещением и компьютерной техникой. При поддержке Санкт-Петербургского Дома книги был пополнен книжный фонд. «Петергоф» также организовал и провел обучение сотрудников Терпеньевского Дома культуры в образовательном центре «Новая ферма» и библиотеках Санкт-Петербурга.\n«В Новый год сбываются мечты. Наши коллеги — Государственный музей-заповедник “Петергоф” и Министерство культуры Российской Федерации — вновь сотворили чудо для наших жителей. Это уже второй центр в Запорожской области, который открывается под эгидой музея-заповедника. Мы искренне вас благодарим за это», — сказал Роман Олексин.\nВо время церемонии открытия также состоялось подписание соглашения о сотрудничестве между музеем-заповедником «Петергоф» и Домом культуры в селе Терпенье.\nПроект «Музей рядом» реализуется «Петергофом» под эгидой Министерства культуры Российской Федерации в рамках оказания поддержки музеям, расположенным на территории Луганской Народной Республики, Донецкой Народной Республики, Херсонской и Запорожской областей. В рамках этой поддержки за 2 года «Петергоф» были открыты и на данный момент успешно функционируют детские центры в Музее истории города Луганска (Луганск), Меловском краеведческом музей (поселок Меловое), Дворце культуры им. Т.Г. Шевченко (Мелитополь), библиотечно-досуговый центр в селе Новоданиловка Акимовского района (Запорожская область)."
    ]
}